<template>
  <div class="home">
    <div class="inner">
      <h2 class="home__title">САМАРСКОЕ ОБЩЕСТВО СОЗНАНИЯ КРИШНЫ</h2>
      <h3>Харе Кришна!</h3>
      <div class="inner__text">
        <p class="home__text">
          Самарское общество сознания Кришны представляет собой древнее монотеистическое учение, основанное на древних ведических трактатах, также известное как Движение "Харе Кришна". Будучи религиозной организацией, деятельность Общества сосредоточена на возрождении утраченного ведического знания и осознания нашими людьми своего великого духовного и культурного наследия. Углубленно изучая науку о душе, последователи Движения сознания Кришны практикуют истинное сострадание по отношению ко всем живым существам. Наше Общество имеет научно-обоснованный потенциал, систематично обучая людей высшей цели - любви к Богу.
          <br>
          Каждое воскресенье  проходят духовно-просветительские программы, для всех интересующихся людей. Вы можете так же подписаться на электронную рассылку новостей обо всех событиях в нашем Обществе и о расписании воскресных, праздничных и других программ.
          <br>
          Пожертвования можно передавать Вриндаван Чандре прабху. По поводу безналичного перевода, обращайтесь за более подробной информацией.
        </p>
        <p class="home__text">
          Дорогие друзья! В связи с принятием закона о миссионерской деятельности нашей властью, теперь любая миссионерская деятельность, в том числе и в интернете, среди тех, кто не является последователем религиозной организации проповедника, карается штрафом от 5 до 50 тысяч рублей!
          <br><br>
          В связи с этим мы предупреждаем, что на этом сайте находится множество материалов и статей о нашем религиозном учении, которые мы выкладываем лично от себя,и скорее лично для себя, потому что нам это нравится, и вдохновляет.
          Мы законопослушные граждане и не хотим нарушать закон, вовлекая в чтение около религиозных материалов, людей, не являющихся последователями нашего или любого другого вероучения. Хотя эти материалы и совсем даже не проповеднические, а скорее просто образовательные. Мы не призываем никого вступать в ряды какой бы то ни было религиозной организации. Если Вы пренебрегли данным сообщением, вся ответственность за чтение ложится на Вас! Мы, со своей стороны, не занимаемся и не собираемся заниматься миссионерской деятельностью в сети.
          <br><br>
          Данный сайт не преследует целей вовлечения лиц не являющихся последователями гаудия-вайшнавов и их доброжелателей в традиции МОСК (ISKCON) Е.М. А.Ч. Бхактиведанты Свами Прабхупады. Создан исключительно для информации и общения данной традиции.
        </p>
      </div>
      <div class="home__images">
        <div class="img_n_caption">
          <img class="home__img" src="@/assets/GauraNitay.jpeg" alt="Gaura_Nitay">
          <p>Шри Шри Нитай Гаура Наттарадж</p>
        </div>
        <div class="img_n_caption">
          <img class="home__img" src="@/assets/Nrisimha.jpeg" alt="Prahlad_Nrisimhadev">
          <p>Шри Шри Прахлада Нрисимха дева</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
// @ is an alias to /src
import HelloWorld from '@/components/HelloWorld.vue'

export default {
  name: 'HomeView',
  components: {
    HelloWorld
  }
}
</script>

<style lang="scss" scoped>

.home {
  padding: 40px;
  box-shadow: 0 0 30px rgba(122, 122, 122, 0.3);
  border-radius: 4px;
}

.inner {
  text-align: center;
}
.inner__text {
  text-align: left;
  margin-bottom: 20px;
}

.home__title {
  text-align: center;
  margin-bottom: 10px;
}

.home h3 {
  text-align: center;
}

.home__text {
  margin-top: 30px;
}

.home__images {
  display: flex;
  justify-content: space-evenly;
}

.img_n_caption {
  //padding: 20px;
  //box-shadow: 0 0 10px #fa860f;
  p {
    margin-top: 10px;
    font-size: 20px;
  }
}

.home__img {
  width: 400px;
  border-radius: 4px;
}

</style>
